#include <ansi.h>
inherit ITEM;

void create()
{
        set_name(HIW "「古乐器篇」" NOR, ({ "yueqi book", "yueqi", "book" }));
        set_weight(200);
	if (clonep())
		set_default_object(__FILE__);
	else {
                set("unit", "本");
		set("long", HIW "记载着古代乐器的笔记，你闲着没事儿"
                            "可以看看(read)。\n" NOR);
		set("value", 50);
		set("material", "paper");
	}
	setup();
}

void init()
{
	add_action("do_read", "read");

}

int do_read(string arg)
{
        if (arg == "yueqi book" || arg == "yueqi" || arg == "book")
                return notify_fail(WHT "\n"
"-----------------------------------------------------\n\n"
"                   中国古乐器介绍\n\n"
"    瑟：瑟，古代弹弦乐器。其历史久远。据《仪礼》记载，\n"
"古代乡饮酒礼、乡射礼、燕礼中，都用瑟伴奏唱歌。战国至\n"
"秦汉之际盛行“竽瑟之歌”。魏晋南北朝时期，瑟是伴奏相\n"
"和歌的常用乐器。隋唐时期用于清乐。以后则只用于宫廷雅\n"
"乐和丁祭音乐 \n\n"
"   排箫：吹奏乐器。又名洞箫、雅箫、颂箫 凤箫、云箫等。\n"
"早在原始社会，已有用芦苇编制成的苇龠。排箫管数、长度，\n"
"历代记载不同，而且形制、大小有别。唐代以前，排箫迳称\n"
"箫。唐宋以后，由于单管竖吹的箫日渐流行，便称编管箫为\n"
"排箫，以示区别。元明两代，排箫改进为精致的櫝箫。清代\n"
"排箫为双翼形制的櫝箫。\n\n"
"   钟：古代打击乐器。钟在古代“八音”分类法中属金部。\n"
"钟盛行于青铜时代。钟在古代不仅是乐器，还是地位和权力\n"
"象征的礼器。王公贵族在朝聘、祭祀等各种仪典、宴飨与日\n"
"常燕乐中，广泛使用着钟乐。敲击钟的正鼓部和侧鼓部可发\n"
"两个频率音，这两个音，一般为大小三度音程。由于青铜钟\n"
"质料坚实和耐腐蚀，数千年来，给我们留下了古代真实的音\n"
"响、 留下了丰富的古钟遗产，它们不分朝代地并存于今世，\n"
"集历代政治、历史、音乐、民俗、冶炼、宗教等各种文化\n"
"内涵于一身，形成奇特的中华古钟文化。\n\n"
"   磬： 质料主要是石灰石，其次是青石和玉石。均上作倨\n"
"句形，下作微弧形。大小厚薄各异。磬架用铜铸成，呈单面\n"
"双层结构，横梁为圆管状。立柱和底座作怪兽状，龙头、鹤\n"
"颈、鸟身、鳖足。造型奇特，制作精美而牢固。磬分上下两\n"
"层悬挂，每层又分为两组，一组为六件，以四、五度关系排\n"
"列；一组为十件，相邻两磬为二、三、四度关系。它们是按\n"
"不同的律（调）组合的。\n\n"
"   笙:  吹奏乐器。早在大约三千多年前的商代已有笙的雏\n"
"形。古代笙用匏做笙斗，在乐器的八音分类法中属匏类。\n\n"
"   埙:  吹奏乐器。原始社会已出现。埙的起源与先民的劳\n"
"动生产活动有关，随着社会的进步而被当成单纯的乐器。\n\n"
"   鼓： 打击乐器。甲骨文中有鼓字，传说最早的鼓，皮面\n"
"用棰敲击，为祀神之用。悬鼓，悬挂起来敲击的鼓。虎座凤\n"
"悬鼓，属“悬而击之”的悬鼓。\n\n"
"  骨笛：骨笛，吹管乐器。距今约八千多年左右，为新石器\n"
"时代早期遗物。骨笛由禽骨制作，长约20厘米、直径约一厘\n"
"米，开管、管侧开七个音孔，无吹孔和笛膜孔。吹奏时需将\n"
"骨笛斜持，顶端吹口与嘴保持一定的倾斜度。\n\n" HIG
"                 一脉相承琴器几千载\n\n"
"                 大浪淘沙古器貌未改\n\n" WHT
"-----------------------------------------------------\n"
"\n\n" NOR);
}
