#include <ansi.h>
inherit ITEM;

void create()
{
        set_name(HIC "「扇赏」" NOR, ({ "shanshang book", "shanshang", "book" }));
        set_weight(200);
	if (clonep())
		set_default_object(__FILE__);
	else {
                set("unit", "本");
		set("long", HIC "这是一本介绍扇的小册，没事可以"
                            "看看(read)。\n" NOR);
		set("value", 50);
		set("material", "paper");
	}
	setup();
}

void init()
{
	add_action("do_read", "read");

}

int do_read(string arg)
{
        if (arg == "shanshang book"
           || arg == "shanshang"
           || arg == "book")
                return notify_fail(HIC "\n"
"----------------------------------------------------------\n\n"
NOR + WHT "                         羽毛扇\n\n"
"  羽扇始于周昭王时，有盂夏取鹊翅为扇之说，则羽毛扇已经有\n"
"  着三千年的历史了。羽毛扇制作的主要原料是大型禽鸟的羽毛。\n\n"
"                         团  扇\n\n"
"  绢宫扇又叫纨扇、团扇、罗扇，它出现于羽扇之后、摺扇以前。\n"
"  西汉成帝的妃嫔班婕妤写过一首有名的团扇歌：「新制齐纨素\n"
"  皎洁如霜雪。裁为合欢扇，团团似明月。出入君怀袖，动摇微\n"
"  风发。常恐秋节至，凉飙夺炎热。弃捐箧笥中，恩情中道绝。」\n\n"
"                         折  扇\n\n"
"  折扇收折自如，扇形小巧玲珑，携带方便，是为很普通的扇品。\n\n"
"                         玉版扇\n\n"
"  浙之括苍山多巨竹，有围至二尺外者。碧湖之民能够截而剖之\n"
"  取其里。阔五六寸、长尺许，熨之使平，其形上宽下稍杀，用\n"
"  红木或明角、玳瑁，雕刻为柄，色白润如玉，因题为‘玉版扇。\n\n"
"                         檀香扇\n\n"
"  檀香扇乃是取檀木制成，扇又轻又小，芳香四溢，是苏州名产。\n\n"
"                         绸舞扇\n\n"
"  绸舞扇多为舞蹈用扇，有半绸全绸之分，扇骨以竹为主，也有\n"
"  用檀香木或牛骨的。扇面采用各式丝绸，印上或绘上花草图案，\n"
"  有的还加上闪光铝片，舞动时绚丽多彩金光熠熠。\n\n"
"                         芭蕉扇\n\n"
"  芭蕉扇，又叫蒲扇、葵扇、蒲葵扇。采下阴干，以重物镇之使\n"
"  平，剪成圆形，削细篾丝，杂锦线缘其边，即仍其柄以为柄是\n"
"  为粗者。有截其柄以名竹、文木、洋漆、象牙、玳瑁为之，饰\n"
"  以翠蝶银花，缘以锦边，是为细者。扇轻便风大且价格低廉。\n\n"
HIC "----------------------------------------------------------\n"
"\n\n" NOR);
}
