// Room: /d/shaolin/zoulang1.c
// Date: YZC 96/01/19

inherit ROOM;

string look_writing();

void create()
{
	set("short", "◊ﬂ¿»");
	set("long", @LONG
’‚¿Ô «Ï¯∑ø◊ﬂ¿»°£∑ø∂•“ª≤‡÷ß‘⁄ƒœ√Êµƒ∏ﬂ«Ω…œ£¨¡Ì“ª≤‡‘Ú”Î
±±±ﬂ∞„»ÙÃ√µƒŒ›∂•œ‡¡¨°£≤ ¡∫ª≠∂∞£¨¡¨∂•≈Ô“≤”√≤ ∆·ªÊ¬˙¡À∏˜÷÷
∑…ÃÏµƒÕº–Œ£¨√ø∑˘ª≠À∆∫ı∂º‘⁄ÀﬂÀµ“ª∏ˆÊ∏Ê∏∂Ø»Àµƒ∑æ≠π  ¬°£ƒœ
±ﬂ«Ω…œÃ‚◊≈“ª∏ˆ◊÷(writing)°£Õ˘±±Õ®Õ˘∞„»ÙÃ√°£
LONG );
	set("exits", ([
		"east" : __DIR__"zoulang2",
		"north" : __DIR__"banruo1",
	]));
	set("item_desc",([
		"writing"		:	(: look_writing :),
	]));
	set("no_clean_up", 0);
	setup();
}

string look_writing()
{
	return
	"\n"
	"    ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ\n"
	"    ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ°°°°≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ\n"
	"    ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ°°≥æ≥æ≥æ°°°°≥æ≥æ≥æ°°≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ\n"
	"    ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ°°≥æ≥æ≥æ°°°°≥æ≥æ≥æ°°≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ\n"
	"    ≥æ≥æ≥æ≥æ≥æ≥æ≥æ°°°°≥æ≥æ≥æ°°°°≥æ≥æ≥æ°°°°≥æ≥æ≥æ≥æ≥æ≥æ≥æ\n"
	"    ≥æ≥æ≥æ≥æ≥æ≥æ°°°°≥æ≥æ≥æ≥æ°°°°≥æ≥æ≥æ≥æ°°°°≥æ≥æ≥æ≥æ≥æ≥æ\n"
	"    ≥æ≥æ≥æ≥æ≥æ≥æ°°°°≥æ≥æ≥æ≥æ°°°°≥æ≥æ≥æ≥æ°°°°≥æ≥æ≥æ≥æ≥æ≥æ\n"
	"    ≥æ≥æ≥æ≥æ≥æ≥æ°°°°≥æ≥æ≥æ≥æ°°°°≥æ≥æ≥æ≥æ°°°°≥æ≥æ≥æ≥æ≥æ≥æ\n"
	"    ≥æ≥æ≥æ≥æ≥æ≥æ≥æ°°≥æ≥æ≥æ≥æ°°°°≥æ≥æ≥æ≥æ≥æ°°≥æ≥æ≥æ≥æ≥æ≥æ\n"
	"    ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ°°°°≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ\n"
	"    ≥æ≥æ≥æ≥æ°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°≥æ≥æ≥æ≥æ\n"
	"    ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ°°°°≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ\n"
	"    ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ°°°°≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ\n"
	"    ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ°°°°≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ\n"
	"    ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ°°°°≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ\n"
	"    ≥æ≥æ°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°≥æ≥æ\n"
	"    ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ≥æ\n";
}

